#+TITLE: June 17-July 3, 2019 (17 days)
#+AUTHOR: dgplug.org
#+EMAIL: users@lists.dgplug.org
#+PROPERTY: Effort_ALL 0 0:05 0:10 0:30 1:00 2:00 3:00 4:00
#+TODO: TODO IN_PROGRESS | DONE DEFERRED
#+COLUMNS: %35ITEM %TASKID %OWNER %3PRIORITY %TODO %5ESTIMATED{+} %3ACTUAL{+}
* REPORTS
** SCRUM BOARD
#+BEGIN: block-update-board
#+END:
** DEVELOPER SUMMARY
#+BEGIN: block-update-summary
#+END:
** BURNDOWN CHART
#+BEGIN: block-update-graph
#+END:
** BURNDOWN LIST
#+PLOT: title:"Burndown" ind:1 deps:(3 4) set:"term dumb" set:"xtics scale 0.5" set:"ytics scale 0.5" file:"burndown.plt" set:"xrange [0:17]"
#+BEGIN: block-update-burndown
#+END:
** TASK LIST
#+BEGIN: columnview :hlines 2 :maxlevel 5 :id "TASKS"
#+END:
* TASKS
  :PROPERTIES:
  :ID:       TASKS
  :SPRINTLENGTH: 17
  :SPRINTSTART: <2019-06-17 Mon>
  :wpd-akshay196: 1
  :wpd-bhavin192: 1
  :wpd-RJ722: 3
  :wpd-sandeepk: 2
  :END:
** akshay196
*** DONE GNU Emacs bug triaging [4/4]
    CLOSED: [2019-07-01 Mon 23:25]
    :PROPERTIES:
    :ESTIMATED: 4
    :ACTUAL:   3.87
    :OWNER: akshay196
    :ID: OPS.1560792095
    :TASKID: OPS.1560792095
    :END:
    :LOGBOOK:
    CLOCK: [2019-07-01 Mon 22:53]--[2019-07-01 Mon 23:24] =>  0:31
    CLOCK: [2019-06-21 Fri 20:57]--[2019-06-21 Fri 21:57] =>  1:00
    CLOCK: [2019-06-20 Thu 23:09]--[2019-06-20 Thu 23:34] =>  0:25
    CLOCK: [2019-06-19 Wed 21:25]--[2019-06-19 Wed 22:20] =>  0:55
    CLOCK: [2019-06-18 Tue 21:44]--[2019-06-18 Tue 22:45] =>  1:01
    :END:
    - [X] [[https://debbugs.gnu.org/cgi/bugreport.cgi?bug=35567][#35567]]: 27.0.50; Emacs-Lisp and ElDoc confusion with some strings
    - [X] [[https://debbugs.gnu.org/cgi/bugreport.cgi?bug=35797][#35797]]: 26.2; Adaptive Wrap does not respect Whitespace Mode faces
    - [X] [[https://debbugs.gnu.org/cgi/bugreport.cgi?bug=35815][#35815]]: 26.2; mhtml-mode (in HTML+CSS and HTML+JS) doesn't respect Whitespace Mode face settings
    - [X] [[https://debbugs.gnu.org/cgi/bugreport.cgi?bug=32784][#32784]]: 25.2; Calc mode home on incorrect line depending on line-spacing
*** DONE Learning GNU Emacs - Part I [10/10]
    CLOSED: [2019-07-03 Wed 08:44]
    :PROPERTIES:
    :ESTIMATED: 13
    :ACTUAL:   15.17
    :OWNER: akshay196
    :ID: READ.1560794346
    :TASKID: READ.1560794346
    :END:
    :LOGBOOK:
    CLOCK: [2019-07-03 Wed 07:20]--[2019-07-03 Wed 08:43] =>  1:23
    CLOCK: [2019-07-02 Tue 21:03]--[2019-07-02 Tue 21:26] =>  0:23
    CLOCK: [2019-07-02 Tue 06:31]--[2019-07-02 Tue 07:35] =>  1:04
    CLOCK: [2019-07-01 Mon 07:04]--[2019-07-01 Mon 07:52] =>  0:48
    CLOCK: [2019-06-30 Sun 18:53]--[2019-06-30 Sun 20:35] =>  1:42
    CLOCK: [2019-06-29 Sat 19:49]--[2019-06-29 Sat 21:03] =>  1:14
    CLOCK: [2019-06-28 Fri 07:02]--[2019-06-28 Fri 08:28] =>  1:26
    CLOCK: [2019-06-27 Thu 07:03]--[2019-06-27 Thu 08:29] =>  1:26
    CLOCK: [2019-06-26 Wed 07:04]--[2019-06-26 Wed 08:14] =>  1:10
    CLOCK: [2019-06-25 Tue 07:01]--[2019-06-25 Tue 08:39] =>  1:38
    CLOCK: [2019-06-24 Mon 08:06]--[2019-06-24 Mon 09:35] =>  1:29
    CLOCK: [2019-06-23 Sun 06:33]--[2019-06-23 Sun 08:00] =>  1:27
    :END:
    3rd Edition
    by Bill Rosenblatt, Eric S. Raymond, Marc Loy, James Elliott, Debra Cameron
    - [X] Chapter  1. Emacs Basics                                   ( 1h)
    - [X] Chapter  2. Editing                                        ( 1h)
    - [X] Chapter  3. Search and Replace                             ( 1h)
    - [X] Chapter  4. Using Buffers, Windows, and Frames             ( 1h)
    - [X] Chapter  5. Emacs as a Work Environment                    ( 2h)
    - [X] Chapter  6. Writing Macros                                 ( 1h)
    - [X] Chapter  7. Simple Text Formatting and Specialized Editing ( 2h)
    - [X] Chapter  8. Markup Language Support                        ( 2h)
    - [X] Chapter  9. Computer Language Support                      ( 1h)
    - [X] Chapter 10. Customizing Emacs                              ( 1h)
** bhavin192
*** DONE Linux Under the Hood [13/13]
    CLOSED: [2019-07-01 Mon 21:47]
    :PROPERTIES:
    :ESTIMATED: 10
    :ACTUAL:   12.02
    :OWNER:    bhavin192
    :ID:       READ.1559581076
    :TASKID:   READ.1559581076
    :END:
    :LOGBOOK:
    CLOCK: [2019-07-01 Mon 21:28]--[2019-07-01 Mon 21:47] =>  0:19
    CLOCK: [2019-07-01 Mon 19:52]--[2019-07-01 Mon 20:34] =>  0:42
    CLOCK: [2019-06-30 Sun 21:08]--[2019-06-30 Sun 21:36] =>  0:28
    CLOCK: [2019-06-30 Sun 19:56]--[2019-06-30 Sun 20:17] =>  0:21
    CLOCK: [2019-06-30 Sun 18:51]--[2019-06-30 Sun 19:25] =>  0:34
    CLOCK: [2019-06-30 Sun 18:08]--[2019-06-30 Sun 18:46] =>  0:38
    CLOCK: [2019-06-30 Sun 16:10]--[2019-06-30 Sun 17:11] =>  1:01
    CLOCK: [2019-06-27 Thu 18:52]--[2019-06-27 Thu 19:29] =>  0:37
    CLOCK: [2019-06-26 Wed 20:06]--[2019-06-26 Wed 20:08] =>  0:02
    CLOCK: [2019-06-26 Wed 18:32]--[2019-06-26 Wed 19:13] =>  0:41
    CLOCK: [2019-06-25 Tue 21:18]--[2019-06-25 Tue 22:13] =>  0:55
    CLOCK: [2019-06-25 Tue 19:20]--[2019-06-25 Tue 20:17] =>  0:57
    CLOCK: [2019-06-24 Mon 21:41]--[2019-06-24 Mon 22:21] =>  0:40
    CLOCK: [2019-06-24 Mon 20:06]--[2019-06-24 Mon 20:10] =>  0:04
    CLOCK: [2019-06-24 Mon 08:26]--[2019-06-24 Mon 08:31] =>  0:05
    CLOCK: [2019-06-21 Fri 19:32]--[2019-06-21 Fri 19:43] =>  0:11
    CLOCK: [2019-06-21 Fri 19:10]--[2019-06-21 Fri 19:29] =>  0:19
    CLOCK: [2019-06-21 Fri 18:43]--[2019-06-21 Fri 19:03] =>  0:20
    CLOCK: [2019-06-19 Wed 19:17]--[2019-06-19 Wed 20:16] =>  0:59
    CLOCK: [2019-06-18 Tue 20:00]--[2019-06-18 Tue 20:34] =>  0:34
    CLOCK: [2019-06-18 Tue 19:29]--[2019-06-18 Tue 19:52] =>  0:23
    CLOCK: [2019-06-17 Mon 19:31]--[2019-06-17 Mon 20:10] =>  0:39
    CLOCK: [2019-06-17 Mon 18:53]--[2019-06-17 Mon 19:25] =>  0:32
    :END:
    https://www.oreilly.com/library/view/linux-under-the/9780134663500/
    - [X] 1.  How Linux is organized                            (25m)
    - [X] 2.  About C code, scripts and compiled programs       (35m)
    - [X] 3.  Understanding Linux commands and how they work    (22m)
    - [X] 4.  Understanding the Linux boot procedure            (90m)
    - [X] 5.  Understanding Linux storage                       (80m)
    - [X] 6.  Understanding memory management                   (40m)
    - [X] 7.  Understanding processes                           (40m)
    - [X] 8.  Security                                          (60m)
    - [X] 9.  Hardware initialization                           (35m)
    - [X] 10. Looking closer at the kernel                      (40m)
    - [X] 11. Understanding networking                          (50m)
    - [X] 12. Performance optimization                          (60m)
    - [X] 13. The future of Linux                               (23m)
*** IN_PROGRESS Namespaces in operation series [1/9]
    :PROPERTIES:
    :ESTIMATED: 4.5
    :ACTUAL:   1.38
    :OWNER:    bhavin192
    :ID:       READ.1560960967
    :TASKID:   READ.1560960967
    :END:
    :LOGBOOK:
    CLOCK: [2019-07-03 Wed 20:05]--[2019-07-03 Wed 20:36] =>  0:31
    CLOCK: [2019-07-02 Tue 19:46]--[2019-07-02 Tue 20:38] =>  0:52
    :END:
    https://lwn.net/Articles/531114/#series_index
    - [X] [[https://lwn.net/Articles/531114/][1. namespaces overview]]                                      (60m)
    - [ ] [[https://lwn.net/Articles/531381/][2: the namespaces API]]                                       (25m)
    - [ ] [[https://lwn.net/Articles/531419/][3: PID namespaces]]                                           (20m)
    - [ ] [[https://lwn.net/Articles/532748/][4: more on PID namespaces]]                                   (35m)
    - [ ] [[https://lwn.net/Articles/532593/][5: User namespaces]]                                          (30m)
    - [ ] [[https://lwn.net/Articles/540087/][6: more on user namespaces]]                                  (25m)
    - [ ] [[https://lwn.net/Articles/580893/][7: Network namespaces]]                                       (15m)
    - [ ] [[https://lwn.net/Articles/689856/][Mount namespaces and shared subtrees]]                        (30m)
    - [ ] [[https://lwn.net/Articles/690679/][Mount namespaces, mount propagation, and unbindable mounts]]  (20m)
*** DONE Architecture for continuous delivery
    CLOSED: [2019-06-27 Thu 22:28]
    :PROPERTIES:
    :ESTIMATED: 3
    :ACTUAL:   2.97
    :OWNER:    bhavin192
    :ID:       READ.1560961999
    :TASKID:   READ.1560961999
    :END:
    :LOGBOOK:
    CLOCK: [2019-06-27 Thu 19:30]--[2019-06-27 Thu 22:28] =>  2:58
    :END:
    https://learning.oreilly.com/live-training/courses/architecture-for-continuous-delivery/0636920276012/
** RJ722
*** DONE Build the profile
    CLOSED: [2019-07-03 Wed 16:02]
    :PROPERTIES:
    :ESTIMATED: 1.5
    :ACTUAL:   0.35
    :OWNER: RJ722
    :ID: TASK.1558159427
    :TASKID: TASK.1558159427
    :END:
    :LOGBOOK:
    CLOCK: [2019-07-03 Wed 15:46]--[2019-07-03 Wed 16:07] =>  0:21
    :END:
    - [ ] Follow tags and technologies that you know about
    - [X] Write a bio for the site
    - [X] Review their guides
*** DONE Read "Why I am a Hindu" [3/3]
    CLOSED: [2019-07-04 Thu 17:44]
    :PROPERTIES:
    :ESTIMATED: 11
    :ACTUAL:   7.97
    :OWNER: RJ722
    :ID: READ.15 60490730
    :TASKID: READ.1560490730
    :END:
    :LOGBOOK:
    CLOCK: [2019-07-04 Thu 17:20]--[2019-07-04 Thu 17:43] =>  0:23
    CLOCK: [2019-07-04 Thu 12:10]--[2019-07-04 Thu 13:00] =>  0:50
    CLOCK: [2019-07-03 Wed 09:10]--[2019-07-03 Wed 10:25] =>  1:15
    CLOCK: [2019-07-02 Tue 09:05]--[2019-07-02 Tue 09:54] =>  0:49
    CLOCK: [2019-07-01 Mon 09:10]--[2019-07-01 Mon 10:30] =>  1:20
    CLOCK: [2019-06-28 Fri 20:00]--[2019-06-28 Fri 20:30] =>  0:30
    CLOCK: [2019-06-27 Thu 19:20]--[2019-06-27 Thu 20:00] =>  0:40
    CLOCK: [2019-06-19 Wed 21:48]--[2019-06-19 Wed 22:35] =>  0:47
    CLOCK: [2019-06-17 Mon 19:41]--[2019-06-17 Mon 21:05] =>  1:24
    :END:
    - [X] Part I
    - [X] Part II
    - [X] Part III
*** DONE Read "The Great Novel of India" - PART 2 [8/8]
    CLOSED: [2019-07-03 Wed 20:00]
    :PROPERTIES:
    :ESTIMATED: 7.5
    :ACTUAL:   7.12
    :OWNER: RJ722
    :ID: READ.1557996292
    :TASKID: READ.1557996292
    :END:
    :LOGBOOK:
    CLOCK: [2019-07-03 Wed 19:30]--[2019-07-03 Wed 20:00] =>  0:30
    CLOCK: [2019-07-03 Wed 19:10]--[2019-07-03 Wed 19:30] =>  0:20
    CLOCK: [2019-07-02 Tue 12:20]--[2019-07-02 Tue 13:00] =>  0:40
    CLOCK: [2019-07-02 Tue 10:00]--[2019-07-02 Tue 10:20] =>  0:20
    CLOCK: [2019-06-24 Mon 22:30]--[2019-06-25 Tue 00:10] =>  1:40
    CLOCK: [2019-06-22 Fri 21:10]--[2019-06-22 Fri 21:55] =>  0:45
    CLOCK: [2019-06-21 Thu 20:34]--[2019-06-21 Thu 21:10] =>  0:36
    CLOCK: [2019-06-20 Thu 09:20]--[2019-06-20 Thu 10:10] =>  0:50
    CLOCK: [2019-06-18 Tue 09:10]--[2019-06-18 Tue 10:36] =>  1:26
    :END:
    - [X] The Eleventh Book
    - [X] The Twelfth Book
    - [X] The Thirteenth Book
    - [X] The Fourteenth Book
    - [X] The Fifteenth Book
    - [X] The Sixteenth Book
    - [X] The Seventeenth Book
    - [X] The Eigteenth Book
*** DONE Write two blog posts - PART 1 [1/2]
    CLOSED: [2019-07-04 Thu 17:47]
    :PROPERTIES:
    :ESTIMATED: 7.5
    :ACTUAL:   2.22
    :OWNER: RJ722
    :ID: WRITE.1560491297
    :TASKID: WRITE.1560491297
    :END:
    :LOGBOOK:
    CLOCK: [2019-07-03 Wed 14:31]--[2019-07-03 Wed 15:44] =>  1:13
    CLOCK: [2019-07-02 Tue 14:20]--[2019-07-02 Tue 15:20] =>  1:00
    :END:
    - [X] Post 1
*** DONE Participate in a Kaggle Competition - PART 1
    CLOSED: [2019-07-04 Thu 17:47]
    :PROPERTIES:
    :ESTIMATED: 5
    :ACTUAL:   4.88
    :OWNER: RJ722
    :ID: DEV.1561010265
    :TASKID: DEV.1561010265
    :END:
    :LOGBOOK:
    CLOCK: [2019-06-30 Sun 19:17]--[2019-06-30 Sun 19:59] =>  0:42
    CLOCK: [2019-06-30 Sun 15:52]--[2019-06-30 Sun 19:09] =>  0:30
    CLOCK: [2019-06-26 Wed 00:48]--[2019-06-26 Wed 01:42] =>  0:54
    :END:
** sandeepk
*** DONE Reliable Cloud Infrastructure: Design and Process [9/9]
    CLOSED: [2019-06-24 Mon 22:05]
    :PROPERTIES:
    :ESTIMATED: 17.33
    :ACTUAL:   10.90
    :OWNER:    sandeepk
    :ID:       READ.1559588374
    :TASKID:   READ.1559588374
    :END:
    :LOGBOOK:
    CLOCK: [2019-06-24 Mon 21:15]--[2019-06-24 Mon 22:05] =>  0:50
    CLOCK: [2019-06-22 Sat 16:30]--[2019-06-22 Sat 17:20] =>  0:50
    CLOCK: [2019-06-22 Sat 15:20]--[2019-06-22 Sat 16:25] =>  1:05
    CLOCK: [2019-06-22 Sat 14:20]--[2019-06-22 Sat 15:00] =>  0:40
    CLOCK: [2019-06-21 Fri 21:53]--[2019-06-21 Fri 22:53] =>  1:00
    CLOCK: [2019-06-21 Fri 21:07]--[2019-06-21 Fri 21:38] =>  0:31
    CLOCK: [2019-06-20 Thu 21:14]--[2019-06-20 Thu 22:25] =>  1:11
    CLOCK: [2019-06-19 Wed 20:33]--[2019-06-19 Wed 23:15] =>  2:42
    CLOCK: [2019-06-18 Tue 21:36]--[2019-06-18 Tue 23:41] =>  2:05
    :END:
    - [X] Welcome to Design and Process                              (20m)
    - [X] Defining the Service                                       (4h)
    - [X] Business-logic Layer Design                                (4h)
    - [X] Data Layer Design                                          (2h)
    - [X] Presentation Layer                                         (2h)
    - [X] Design for Resiliency, Scalability, and Disaster Recovery  (1h)
    - [X] Design for Security                                        (1h)
    - [X] Capacity Planning and Cost Optimization                    (1h)
    - [X] Deployment, Monitoring and Alerting, and Incident Response (2h)
*** DONE Blog writing - Part I [1/1]
    CLOSED:[2019-07-03 Wed 00:32]
    :PROPERTIES:
    :ESTIMATED: 8
    :ACTUAL:   6.07
    :OWNER: sandeepk
    :ID: WRITE.1560792221
    :TASKID: WRITE.1560792221
    :END:
    :LOGBOOK:
    CLOCK: [2019-07-02 Tue 23:32]--[2019-07-03 Wed 00:32] =>  1:00
    CLOCK: [2019-07-01 Mon 22:10]--[2019-07-02 Tue 00:49] =>  2:40
    CLOCK: [2019-06-29 Sat 22:30]--[2019-06-29 Sat 23:10] =>  0:40
    CLOCK: [2019-06-28 Fri 21:50]--[2019-06-28 Fri 22:35] =>  0:45
    CLOCK: [2019-06-25 Tue 21:30]--[2019-06-25 Tue 22:30] =>  1:00
    :END:
    - [X] Blog about Google Cloud Platform IAM(Identiy and Access Management) (4h)
